notes/meeting_2022jul24.org
* meeting notes July 24, 2022
** the raku study group
**** usual links
***** these notes
****** https://github.com/doomvox/raku-study/blob/main/notes/meeting_2022jul24.md
***** code examples
****** https://github.com/doomvox/raku-study/tree/main/bin/2022jul24


** current topics
*** make/made
**** grammars again

** earlier topics
*** regex feature: control what's captured with <( ... )>
***** <( isn't really equivalent to \K in a substitution
***** can do it with zero-width after/before matches
***** or by having multiple ordered captures, etc.

***** william michels turned up this on the subject:
https://stackoverflow.com/questions/63426361/raku-effect-of-capture-markers-is-lost-higher-up

**** the double-asterix non-flattening slurpy array signature
***** so the single asterix is flattening?
***** TODO investigate further, for next time


**** rob ramsbottom
***** rob opened a github issue, no action:
****** https://github.com/rakudo/rakudo/issues/4945
****** TODO add some comments, at the very least confirm the behavior.



** announcements 
*** August 7th: next raku study group meeting
*** August 13th & 14th: online raku conference
**** https://conf.raku.org/
